weidong-deng/LittleFS/Libraries/APM32F10x_StdPeriphDriver/src/apm32f10x_usb_host.c
/*!
 * @file        apm32f10x_usb_host.h
 *
 * @brief       USB host function handle
 *
 * @version     V1.0.1
 *
 * @date        2023-03-27
 *
 * @attention
 *
 *  Copyright (C) 2023 Geehy Semiconductor
 *
 *  You may not use this file except in compliance with the
 *  GEEHY COPYRIGHT NOTICE (GEEHY SOFTWARE PACKAGE LICENSE).
 *
 *  The program is only for reference, which is distributed in the hope
 *  that it will be useful and instructional for customers to develop
 *  their software. Unless required by applicable law or agreed to in
 *  writing, the program is distributed on an "AS IS" BASIS, WITHOUT
 *  ANY WARRANTY OR CONDITIONS OF ANY KIND, either express or implied.
 *  See the GEEHY SOFTWARE PACKAGE LICENSE for the governing permissions
 *  and limitations under the License.
 */

/* Includes */
#include "apm32f10x_usb_host.h"

/** @addtogroup APM32F10x_StdPeriphDriver
  @{
*/

#if defined (USB_OTG_FS)

/** @addtogroup USB_Host_Driver USB Host Driver
  @{
*/

/** @defgroup USB_Host_Functions Functions
  @{
*/

/*!
 * @brief     USB host configure data PID
 *
 * @param     usbhh: USB host handler.
 *
 * @param     channelNum: channel number
 *
 * @param     dataPid: data PID
 *
 * @retval    None
 */
void USBH_ConfigDataPid(USBH_HANDLE_T* usbhh, uint8_t channelNum, uint8_t dataPid)
{
    if (usbhh->xferPipe[channelNum].epDir == EP_DIR_IN)
    {
        usbhh->xferPipe[channelNum].pidToggleIn = dataPid;
    }
    else
    {
        usbhh->xferPipe[channelNum].pidToggleOut = dataPid;
    }
}

/*!
 * @brief       Handle Disconnect detected interrupt
 *
 * @param       usbhh: USB host handler.
 *
 * @retval      None
 */
static void USBH_DisconnectIsrHandler(USBH_HANDLE_T* usbhh)
{
    /* Clear interrupt */
    USB_OTG_ClearGlobalIntFlag(usbhh->usbGlobal, USB_INT_G_DEDIS);

    /* Host port is disconnected */
    if (USB_OTG_H_PortIsConnect(usbhh->usbHost) == RESET)
    {
        /* Clear USB FIFO*/
        USB_OTG_FlushTxFIFO(usbhh->usbGlobal, 0x10);
        USB_OTG_FlushRxFIFO(usbhh->usbGlobal);

        /* Reset FS clock*/
        USB_OTG_H_ConfigHostClk(usbhh->usbHost, PHYCLK_48_MHZ);
        USB_OTG_H_SetFrameInterval(usbhh->usbHost, 48000);

        /* Disconnect event callback */
        USBH_DisconnectCallback(usbhh);
    }
}

/*!
 * @brief       Handle RxFIFO no empty interrupt
 *
 * @param       usbhh: USB host handler.
 *
 * @retval      None
 */
static void USBH_RxFifoNoEmptyIsrHandler(USBH_HANDLE_T* usbhh)
{
    USBH_FIFO_STA_T fifoStatus;
    uint16_t channelNum;
    uint8_t packetStatus;
    uint16_t packetCnt;

    /* Disable RxFIFO no empty Interrup */
    USB_OTG_DisableGlobalInterrupt(usbhh->usbGlobal, USB_INT_G_RXFNONE);

    /* Read and pop the RxFIFO status data */
    fifoStatus.FIFO_STATUS = USB_OTG_PopRxFifoStatus(usbhh->usbGlobal);
    channelNum = fifoStatus.FIFO_STATUS_B.chNum;
    packetStatus = fifoStatus.FIFO_STATUS_B.packetStatus;
    packetCnt = fifoStatus.FIFO_STATUS_B.byteCount;

    switch (packetStatus)
    {
        case USBH_PKTSTS_IN:
            /* Read the data into the host buffer */
            if ((packetCnt > 0) && (usbhh->xferPipe[channelNum].buffer != NULL))
            {
                if ((usbhh->xferPipe[channelNum].bufCount + packetCnt) > \
                        usbhh->xferPipe[channelNum].bufLen)
                {
                    usbhh->xferPipe[channelNum].urbStatus = USB_URB_ERROR;
                }
                else
                {
                    USB_OTG_FIFO_ReadRxFifoPacket(usbhh->usbFifo, usbhh->xferPipe[channelNum].buffer \
                                                  , packetCnt);

                    /*manage multiple Xfer */
                    usbhh->xferPipe[channelNum].buffer     += packetCnt;
                    usbhh->xferPipe[channelNum].bufCount   += packetCnt;

                    if ((USB_OTG_H_ReadPacketCount(usbhh->usbHost, channelNum) > 0) && \
                            (usbhh->xferPipe[channelNum].maxPackSize == packetCnt))
                    {
                        /* re-activate the channel when more packets are expected */
                        USB_OTG_H_EnableChannel(usbhh->usbHost, channelNum);

                        usbhh->xferPipe[channelNum].pidToggleIn ^= 1;
                    }
                }
            }
            break;

        case USBH_PKTSTS_IN_XFER_COMPLETE:
            break;

        case USBH_PKTSTS_DATA_ISO_ERR:
            break;

        case USBH_PKTSTS_CHANNEL_HALT:
            break;

        default:
            break;
    }

    /* Enable RxFIFO no empty Interrupt */
    USB_OTG_EnableGlobalInterrupt(usbhh->usbGlobal, USB_INT_G_RXFNONE);
}

/*!
 * @brief     Halt usb host channel
 *
 * @param     usbhh: USB host handler.
 *
 * @param     chNum: host channel number
 *
 * @retval    None
 */
void USB_OTG_H_HaltChannel(USBH_HANDLE_T* usbhh, uint8_t chNum)
{
    __IO uint32_t timeout = 0;
    uint8_t epTypte;
    uint8_t chEnableSta;
    uint8_t dmaEnableSta;

    epTypte = USB_OTG_H_ReadEpType(usbhh->usbHost, chNum);
    chEnableSta = USB_OTG_H_ReadChannelStatus(usbhh->usbHost, chNum);
    dmaEnableSta = USB_OTG_ReadDMAStatus(usbhh->usbGlobal);

    /* HS DMA enable status */
    if ((dmaEnableSta == ENABLE) && (chEnableSta == DISABLE))
    {
        return;
    }

    /* Read Remain space to issue the halt event */
    switch (epTypte)
    {
        case EP_TYPE_CONTROL:
        case EP_TYPE_BULK:
            /* stop channel */
            usbhh->usbHost->REGS_HCH[chNum].HCH_B.CHINT = BIT_SET;

            if (dmaEnableSta == DISABLE)
            {
                if (usbhh->usbGlobal->GNPTXFQSTS_B.NPTXRSA == 0)
                {
                    usbhh->usbHost->REGS_HCH[chNum].HCH_B.CHEN = BIT_RESET;
                    usbhh->usbHost->REGS_HCH[chNum].HCH_B.CHEN = BIT_SET;

                    while (usbhh->usbHost->REGS_HCH[chNum].HCH_B.CHEN)
                    {
                        timeout++;

                        if (timeout >= 0x400)
                        {
                            break;
                        }
                    }
                }
                else
                {
                    usbhh->usbHost->REGS_HCH[chNum].HCH_B.CHEN = BIT_SET;
                }
            }
            break;

        default:
            /* stop channel */
            usbhh->usbHost->REGS_HCH[chNum].HCH_B.CHINT = BIT_SET;

