weidong-deng/LittleFS/Libraries/APM32F10x_StdPeriphDriver/src/apm32f10x_usb_host.c
            case PIPE_XACTERR:
            case PIPE_DATATGLERR:
                usbhh->xferPipe[channelNum].errorCnt++;
                if (usbhh->xferPipe[channelNum].errorCnt >= 3)
                {
                    usbhh->xferPipe[channelNum].errorCnt = 0;
                    usbhh->xferPipe[channelNum].urbStatus = USB_URB_ERROR;
                }
                else
                {
                    usbhh->xferPipe[channelNum].urbStatus = USB_URB_NOREADY;
                    /* reactivate the host channel */
                    usbhh->usbHost->REGS_HCH[channelNum].HCH_B.CHINT = BIT_RESET;
                    usbhh->usbHost->REGS_HCH[channelNum].HCH_B.CHEN = BIT_SET;
                }
                break;

            case PIPE_NAK:
                usbhh->xferPipe[channelNum].urbStatus = USB_URB_NOREADY;
                break;

            default:
                break;
        }

        USB_OTG_H_ClearChannelIntFlag(usbhh->usbHost, channelNum, CHANNEL_INT_TSFCMPAN);

        /* USB update URB status callback */
        USBH_UpdateUrbCallback(usbhh);
    }
    else
    {

    }
}

/*!
 * @brief       Handle Host channels interrupt
 *
 * @param       usbhh: USB host handler.
 *
 * @retval      None
 */
static void USBH_HostChannelsIsrHandler(USBH_HANDLE_T* usbhh)
{
    uint32_t i = 0;

    for (i = 0; i < usbhh->usbCfg.hostChannelNum; i++)
    {
        if (USB_OTG_H_ReadAllChannelsIntFlag(usbhh->usbHost, 1 << (i & 0x0F)) == SET)
        {
            if (USB_OTG_H_ReadEpDirection(usbhh->usbHost, i) == EP_DIR_IN)
            {
                USBH_IN_HostChannelIsrHandler(usbhh, i);
            }
            else
            {
                USBH_OUT_HostChannelIsrHandler(usbhh, i);
            }
        }
    }

    /* Clear interrupt */
    USB_OTG_ClearGlobalIntFlag(usbhh->usbGlobal, USB_INT_G_HCHAN);
}

/*!
 * @brief       Handle Host port interrupt
 *
 * @param       usbhh: USB host handler.
 *
 * @retval      None
 */
static void USBH_HostPortIsrHandler(USBH_HANDLE_T* usbhh)
{
    __IO uint32_t temp;

    /* Store port status*/
    temp = usbhh->usbHost->HPORTCSTS;
    temp &= ~(BIT1 | BIT2 | BIT3 | BIT5);

    /* Read Port Connect Flag */
    if (USB_OTG_H_ReadPortConnectIntTriFlag(usbhh->usbHost) == SET)
    {
        if (USB_OTG_H_PortIsConnect(usbhh->usbHost) == SET)
        {
            /* USB host connect callback */
            USBH_ConnectCallback(usbhh);
        }

        /* PCINTFLG */
        temp |= BIT1;
    }

    /* Port Enable is Changed */
    if (USB_OTG_H_PenBitIsChange(usbhh->usbHost) == SET)
    {
        /* PENCHG */
        temp |= BIT3;

        /* Port is Enable */
        if (USB_OTG_H_PortIsEnable(usbhh->usbHost) == SET)
        {
            if (usbhh->usbCfg.phyType == USB_OTG_PHY_EMB)
            {
                if(usbhh->usbCfg.speed == USB_SPEED_FSLS)
                {
                    if (USB_OTG_H_ReadPortSpeedType(usbhh->usbHost) == USBH_PORT_SPEED_LS)
                    {
                        USB_OTG_H_ConfigHostClk(usbhh->usbHost, PHYCLK_6_MHZ);
                        USB_OTG_H_SetFrameInterval(usbhh->usbHost, 6000);
                    }
                    else
                    {
                        USB_OTG_H_ConfigHostClk(usbhh->usbHost, PHYCLK_48_MHZ);
                        USB_OTG_H_SetFrameInterval(usbhh->usbHost, 48000);
                    }
                }
                else
                {
                    if (USB_OTG_H_ReadPortSpeedType(usbhh->usbHost) == USBH_PORT_SPEED_LS)
                    {
                        USB_OTG_H_ConfigHostClk(usbhh->usbHost, PHYCLK_6_MHZ);
                        USB_OTG_H_SetFrameInterval(usbhh->usbHost, 6000);
                    }
                    else
                    {
                        USB_OTG_H_ConfigHostClk(usbhh->usbHost, PHYCLK_30_60_MHZ);
                    }
                }
            }
            else
            {
                if (usbhh->usbCfg.speed == USB_SPEED_FSLS)
                {
                    USB_OTG_H_SetFrameInterval(usbhh->usbHost, 60000);
                }
            }

            /* USB host enable callback */
            USBH_PortEnableCallback(usbhh);
        }
        else
        {
            /* USB host disable callback */
            USBH_PortDisableCallback(usbhh);
        }
    }

    /* Port overcurrent is Changed */
    if (USB_OTG_H_PovcBitIsChange(usbhh->usbHost) == SET)
    {
        /* POVCCHG */
        temp |= BIT5;
    }

    usbhh->usbHost->HPORTCSTS = temp;
}

/*!
 * @brief     Handle USB host global interrupt
 *
 * @param     usbhh: USB host handler
 *
 * @retval    None
 */
void USBH_OTG_IsrHandler(USBH_HANDLE_T* usbhh)
{
    if (USB_OTG_ReadMode(usbhh->usbGlobal) == USB_OTG_MODE_HOST)
    {
        /* Avoid spurious interrupt */
        if (USB_OTG_ReadInterrupts(usbhh->usbGlobal) == 0U)
        {
            return;
        }

        /* Nonperiodic TXFIFO Empty Interrupt */
        if (USB_OTG_ReadGlobalIntFlag(usbhh->usbGlobal, USB_INT_G_NPTXFEM))
        {
            /* Clear interrupt */
            USB_OTG_ClearGlobalIntFlag(usbhh->usbGlobal, USB_INT_G_NPTXFEM);
        }

        /* Incomplete Periodic Transfer Interrupt */
        if (USB_OTG_ReadGlobalIntFlag(usbhh->usbGlobal, USB_INT_G_IP_OUTTX))
        {
            /* Clear interrupt */
            USB_OTG_ClearGlobalIntFlag(usbhh->usbGlobal, USB_INT_G_IP_OUTTX);
        }
        
        /* Incomplete Isochronous IN Transfer Interrupt */
        if (USB_OTG_ReadGlobalIntFlag(usbhh->usbGlobal, USB_INT_G_IIINTX))
        {
            /* Clear interrupt */
            USB_OTG_ClearGlobalIntFlag(usbhh->usbGlobal, USB_INT_G_IIINTX);
        }
        
        /* Periodic TXFIFO Empty Interrupt */
        if (USB_OTG_ReadGlobalIntFlag(usbhh->usbGlobal, USB_INT_G_PTXFE))
        {
            /* Clear interrupt */
            USB_OTG_ClearGlobalIntFlag(usbhh->usbGlobal, USB_INT_G_PTXFE);
        }
        
        /* Mode Mismatch Interrupt */
        if (USB_OTG_ReadGlobalIntFlag(usbhh->usbGlobal, USB_INT_G_MMIS))
        {
            /* Clear interrupt */
            USB_OTG_ClearGlobalIntFlag(usbhh->usbGlobal, USB_INT_G_MMIS);
        }

        /* Handle Disconnect detected interrupt */
        if (USB_OTG_ReadGlobalIntFlag(usbhh->usbGlobal, USB_INT_G_DEDIS))
        {
            USBH_DisconnectIsrHandler(usbhh);
        }

        /* Handle Host Port Interrupt */
        if (USB_OTG_ReadGlobalIntFlag(usbhh->usbGlobal, USB_INT_G_HPORT))
        {
            USBH_HostPortIsrHandler(usbhh);
        }

