weidong-deng/LittleFS/Libraries/APM32F10x_StdPeriphDriver/src/apm32f10x_usb_host.c
    }

    /* Enable host channel halt interrupt */
    usbhh->usbHost->REGS_HCH[channelNum].HCHIMASK |= CHANNEL_INT_TSFCMPAN;

    /* Enable host channel interrupt */
    usbhh->usbHost->HACHIMASK |= (0x00000001 << (channelNum & 0x0F));

    /* Enable global host channel interrupt */
    usbhh->usbGlobal->GINTMASK_B.HCHM = BIT_SET;

    /* Configure host channle feature */

    /* End point direction */
    if ((endPointNum & 0x80) == 0x80)
    {
        usbhh->usbHost->REGS_HCH[channelNum].HCH_B.EDPDRT = BIT_SET;
    }
    else
    {
        usbhh->usbHost->REGS_HCH[channelNum].HCH_B.EDPDRT = BIT_RESET;
    }

    /* USB LS device plugged to host */
    if ((devSpeed == USBH_DEV_SPEED_LOW) && \
            (usbhh->usbHost->HPORTCSTS_B.PSPDSEL != USBH_DEV_SPEED_LOW))
    {
        USB_OTG_H_EnableLowSpeedDevice(usbhh->usbHost, channelNum);
    }
    else
    {
        USB_OTG_H_DisableLowSpeedDevice(usbhh->usbHost, channelNum);
    }

    /* Device address */
    USB_OTG_H_ConfigDeviceAddr(usbhh->usbHost, channelNum, devAddr);

    /* Endpoint number */
    USB_OTG_H_ConfigEpNum(usbhh->usbHost, channelNum, endPointNum);

    /* Endpoint type */
    USB_OTG_H_ConfigEpType(usbhh->usbHost, channelNum, epType);

    /* Max data packet size */
    USB_OTG_H_ConfigEpMaxPSize(usbhh->usbHost, channelNum, packetMaxSize);

    /* Interrupt or ISO type */
    if ((epType == EP_TYPE_INTERRUPT) || (epType == EP_TYPE_ISO))
    {
        USB_OTG_H_TxUseOddFrame(usbhh->usbHost, channelNum);
    }
}

/*!
 * @brief     USB host channel start transfer
 *
 * @param     usbhh: USB host handler
 *
 * @param     xferPipe: transfer channel
 *
 * @retval    None
 */
void USB_OTG_ChannelStartXfer(USBH_HANDLE_T* usbhh, USBH_XFER_PIPE_T* xferPipe)
{
    uint16_t packetNum;
    uint16_t transferWordLen = 0;
    uint8_t frameParity = 0;
    uint32_t temp;

    /*  Get the number of packets to transfer */
    if (xferPipe->bufLen > 0)
    {
        packetNum = (uint16_t)((xferPipe->bufLen + xferPipe->maxPackSize - 1) / xferPipe->maxPackSize);

        if (packetNum > 256)
        {
            packetNum = 256;
            xferPipe->bufSize = (uint32_t)packetNum * xferPipe->maxPackSize;
        }
    }
    else
    {
        packetNum = 1;
    }

    if (xferPipe->epDir == EP_DIR_OUT)
    {
        xferPipe->bufSize = xferPipe->bufLen;
    }
    /* For IN channel xfer size is expected to be an integer multiple of maxPackSize size */
    else
    {
        xferPipe->bufSize = (uint32_t)packetNum * xferPipe->maxPackSize;
    }

    /* Config the HCHTSIZE register */
    usbhh->usbHost->REGS_HCH[xferPipe->chNum].HCHTSIZE = (xferPipe->bufSize) |
            (((uint32_t)packetNum << 19)) |
            (((uint32_t)xferPipe->pid << 29));

    if (usbhh->usbCfg.dmaStatus == ENABLE)
    {
        USB_OTG_H_ConfigDMAAddr(usbhh->usbHost, xferPipe->chNum, (uint32_t) xferPipe->buffer);
    }

    frameParity = (((uint32_t)usbhh->usbHost->HFIFM & 0x01) != 0) ? 0 : 1;
    usbhh->usbHost->REGS_HCH[xferPipe->chNum].HCH_B.ODDF = BIT_RESET;
    usbhh->usbHost->REGS_HCH[xferPipe->chNum].HCH_B.ODDF = frameParity;

    temp = usbhh->usbHost->REGS_HCH[xferPipe->chNum].HCH;
    temp &= ~BIT30;

    if (xferPipe->epDir == EP_DIR_OUT)
    {
        temp &= ~BIT15;
    }
    else
    {
        temp |= BIT15;
    }

    /* Must be enabled after the channel are configured */
    /* Enable channel */
    temp |= BIT31;
    usbhh->usbHost->REGS_HCH[xferPipe->chNum].HCH = temp;

    if (usbhh->usbCfg.dmaStatus == ENABLE)
    {
        return;
    }

    if ((xferPipe->bufLen > 0) && (xferPipe->epDir == EP_DIR_OUT))
    {
        if ((xferPipe->epType == EP_TYPE_CONTROL) || \
                (xferPipe->epType == EP_TYPE_BULK))
        {
            transferWordLen = (uint16_t)((xferPipe->bufLen + 3) / 4);

            /* check FIFO space */
            if (transferWordLen > usbhh->usbGlobal->GNPTXFQSTS_B.NPTXFSA)
            {
                /* enable Non-periodic TxFIFO empty interrupt */
                USB_OTG_EnableGlobalInterrupt(usbhh->usbGlobal, USB_INT_G_NPTXFEM);
            }
        }
        else if ((xferPipe->epType == EP_TYPE_INTERRUPT) || \
                 (xferPipe->epType == EP_TYPE_ISO))
        {
            transferWordLen = (uint16_t)((xferPipe->bufLen + 3) / 4);

            /* check FIFO space */
            if (transferWordLen > usbhh->usbHost->HPTXSTS_B.FSPACE)
            {
                /* enable Non-periodic TxFIFO empty interrupt */
                USB_OTG_EnableGlobalInterrupt(usbhh->usbGlobal, USB_INT_G_PTXFE);
            }
        }
        else
        {
        }

        /* Write packet into FIFO */
        USB_OTG_FIFO_WriteFifoPacket(usbhh->usbFifo, xferPipe->chNum, \
                                     xferPipe->buffer, (uint16_t)xferPipe->bufLen, \
                                     usbhh->usbCfg.dmaStatus);
    }
}

/*!
 * @brief     USB host channel submit request handler
 *
 * @param     usbhh: USB host handler
 *
 * @param     channelNum : channel number
 *
 * @param     dir : channel direction
 *
 * @param     epType : endpoint type
 *
 * @param     tokenType : tokenType
 *
 * @param     buffer : URB data
 *
 * @param     length : length of URB data
 *
 * @param     pingStatus : ping status
 *
 * @retval    None
 */
void USBH_OTG_ChannelSubReq(USBH_HANDLE_T* usbhh, uint8_t channelNum, uint8_t dir, \
                            uint8_t epType, uint8_t tokenType, uint8_t* buffer, \
                            uint16_t length, uint8_t pingStatus)
{
    usbhh->xferPipe[channelNum].epDir   = (USB_EP_DIR_T)dir;
    usbhh->xferPipe[channelNum].epType  = epType;

    if (tokenType == USBH_PID_SETUP)
    {
        usbhh->xferPipe[channelNum].pid = USB_OTG_PID_SETUP;
        usbhh->xferPipe[channelNum].pingStatus = pingStatus;
    }
    /* token type = USBH_PID_DATA */
    else
    {
        usbhh->xferPipe[channelNum].pid = USB_OTG_PID_DATA1;
    }

    /* data toggle */
    switch (epType)
    {
        case EP_TYPE_CONTROL:
            if ((tokenType == USBH_PID_DATA) && (dir == EP_DIR_OUT))
            {
                if (length == 0)
                {
                    usbhh->xferPipe[channelNum].pidToggleOut = 1;
                }

                if (usbhh->xferPipe[channelNum].pidToggleOut)
                {
                    usbhh->xferPipe[channelNum].pid = USB_OTG_PID_DATA1;
                }
                else
                {
                    usbhh->xferPipe[channelNum].pid = USB_OTG_PID_DATA0;
                }
            }
            break;

        case EP_TYPE_BULK:
        case EP_TYPE_INTERRUPT:
            if (dir == EP_DIR_OUT)
            {
                if (usbhh->xferPipe[channelNum].pidToggleOut)
                {
                    usbhh->xferPipe[channelNum].pid = USB_OTG_PID_DATA1;
                }
                else
                {
                    usbhh->xferPipe[channelNum].pid = USB_OTG_PID_DATA0;
                }
            }
            else
            {
                if (usbhh->xferPipe[channelNum].pidToggleIn)
                {
                    usbhh->xferPipe[channelNum].pid = USB_OTG_PID_DATA1;
                }
                else
                {
                    usbhh->xferPipe[channelNum].pid = USB_OTG_PID_DATA0;
                }
            }
            break;

        case EP_TYPE_ISO:
            usbhh->xferPipe[channelNum].pid = USB_OTG_PID_DATA0;
            break;

        default:
            break;
    }

    usbhh->xferPipe[channelNum].buffer      = buffer;
    usbhh->xferPipe[channelNum].bufLen      = length;
    usbhh->xferPipe[channelNum].urbStatus   = USB_URB_IDLE;
    usbhh->xferPipe[channelNum].bufCount    = 0;
    usbhh->xferPipe[channelNum].chNum       = channelNum;
    usbhh->xferPipe[channelNum].pipeState   = PIPE_IDLE;

    /* Start transfer */
    USB_OTG_ChannelStartXfer(usbhh, &usbhh->xferPipe[channelNum]);
}

/*!
 * @brief     USB OTG host read size of last xfer
 *
 * @param     usbhh: USB host handler
 *
 * @param     channelNum: channel number
 *
 * @retval    xfer size
 */
uint32_t USBH_OTG_ReadXferSize(USBH_HANDLE_T* usbhh, uint8_t channelNum)
{
    uint32_t xferSize;

    xferSize = usbhh->xferPipe[channelNum].bufCount;

